[BladestormOverwatch X2AbilityTemplate]
LocFriendlyName="Melee Counterattack"
LocHelpText="Free melee attack on any enemies that enter range."
LocLongDescription="<Ability:NickName/> takes a free melee attack on any enemies that enter range."
LocFlyOverText="Melee Counterattack"

[X2StrategyGameRulesetDataStructures]
MissionDifficultyLabels[0]="Moderate"
MissionDifficultyLabels[1]="Challenging"
MissionDifficultyLabels[2]="Difficult"
MissionDifficultyLabels[3]="Very Difficult"
MissionDifficultyLabels[4]="! Formidable !"

[XGLocalizedData]
MissionDifficultyNames[eMissionDiff_Easy]="Moderate"
MissionDifficultyNames[eMissionDiff_Moderate]="Challenging"
MissionDifficultyNames[eMissionDiff_Hard]="Difficult"
MissionDifficultyNames[eMissionDiff_VeryHard]="Very Difficult"

[BomberStrike X2AbilityTemplate]
LocFriendlyName="Melee Strike"
LocLongDescription="The unit strikes an enemy with it's weapon. This action ends the turn."
LocHelpText="Strike at a melee target."
LocFlyOverText="Melee Strike"